Repository: autohotkey-docs-translation/v2-ja
Catalog: omegat/project_save.tmx
Source language: en
Languages: ja

source: To include a multi-statement expression in a parameter list, enclose it in an extra set of parentheses.
ja: 複数ステートメント式をパラメータ・リストに含めるには、括弧で囲む。

source: To include a tilde as data in p2 or p3, preceded it with a back-tick, i.e. `~.
ja: p2またはp3にチルダをデータとして含めるには、チルダの前にバックチック、すなわち`~を付ける。

source: To include an actual quote character inside a quoted string, use the `" or `' escape sequence or enclose the character in the opposite type of quote mark.
ja: 引用符で囲まれた文字列の中に実際の引用符を含めるには、`"または`' エスケープシーケンスを使用するか、反対のタイプの引用符でその文字を囲みます。

source: To include buttons with items at the root of the tree view, TVS_LINESATROOT must also be specified.
ja: ツリービューのルートにあるアイテムをボタンに含めるには、TVS_LINESATROOTも指定する必要があります。

source: To include more than one file extension in the filter, separate them with semicolons as illustrated in the example above.
ja: 複数のファイル拡張子をフィルターに含めるには、上の例のようにセミコロンで区切ってください。

source: To include the contents of the same file multiple times, use #IncludeAgain.
ja: 同じファイルの内容を複数回インクルードする場合は、#IncludeAgainを使用します。

source: To indicate the buttons displayed in the message box, add one of the following values:
ja: メッセージボックスに表示されるボタンを指示するために、以下の値のいずれかを追加します：

source: To indicate the default button, add one of the following values:
ja: デフォルトのボタンを示すには、以下の値のいずれかを追加します：

source: To indicate the modality of the dialog box, add one of the following values:
ja: ダイアログボックスのモダリティを示すために、以下の値のいずれかを追加します：

source: To indicate the relationship between String1 and String2, this function returns one of the following:
ja: String1とString2の関係を示すために、この関数は以下のいずれかを返す：

source: To insert an array of values, pass theArray* as the last parameter.
ja: 値の配列を挿入するには、次のように渡します。 theArray*を最後のパラメータとして指定します。

source: To install an additional version from SOURCE (which should be a directory containing AutoHotkey*.exe files), execute the following from within the current installation directory (adjusting the path of AutoHotkey32.exe as needed):
ja: SOURCE（AutoHotkey*.exeファイルを含むディレクトリ）から追加バージョンをインストールするには、現在のインストールディレクトリ内で以下を実行します（必要に応じてAutoHotkey32.exeのパスを調整します）：

source: To instead act upon only the topmost window, follow this example:
ja: その代わりに、一番上のウィンドウだけを操作する場合は、次のようにします：

source: To instead allow the main window to be minimized normally, override the default handling with OnMessage.
ja: その代わりにメインウィンドウを普通に最小化できるようにするには、OnMessageでデフォルトの処理をオーバーライドします。

source: To instead buffer such events until later, use Critical as the callback's first line (however, this will also buffer/defer other threads such as the press of a hotkey).
ja: このようなイベントを後でバッファリングするには、コールバックの最初の行にCriticalを使用します（ただし、この場合、ホットキーの押下など他のスレッドもバッファリング/ディファーされます）。

source: To instead compare according to the rules of the current user's locale, use StrCompare and specify "Locale" for the CaseSense parameter.
ja: 代わりに、現在のユーザーのロケールのルールに従って比較するには、StrCompareを使用し、CaseSenseパラメータに「Locale」を指定する。

source: To instead copy the contents of a folder (all its files and subfolders), see the examples section below.
ja: フォルダの内容（すべてのファイルとサブフォルダ）をコピーする代わりに、以下の例のセクションをご覧ください。

source: To instead copy the contents of a folder (all its files and subfolders), see the examples section of FileCopy.
ja: フォルダの内容（そのすべてのファイルとサブフォルダ）を代わりにコピーするには、FileCopyの例のセクションを参照してください。

source: To instead discover how many tabs (pages) exist in a tab control, follow this example:
ja: タブコントロールにいくつのタブ（ページ）が存在するのかを知るには、次のような例があります：

source: To instead discover the width and height of the entire desktop (even if it spans multiple monitors), use the following example:
ja: デスクトップ全体の幅と高さを知るには（複数のモニターにまたがっていても）、次の例を使う：

source: To instead display a literal ampersand, specify two consecutive ampersands (&&).
ja: アンパサンドを表示させる場合は、アンパサンド（&&）を2つ連続して指定します。

source: To instead have them stop at the first possible character, follow them with a question mark.
ja: その代わりに、可能性のある最初の文字で止めさせるには、その後にクエスチョンマークを付ける。

source: To instead locate the installed copy of AutoHotkey, read the registry as shown above.
ja: 代わりにインストールされたAutoHotkeyのコピーを見つけるには、上記のようにレジストリを読み取ります。

source: To instead make a new reference, use one of the following:
ja: その代わりに新しいリファレンスを作成するには、以下のいずれかを使用する：

source: To instead move the contents of a folder (all its files and subfolders), see the examples section below.
ja: フォルダの内容（すべてのファイルとサブフォルダ）を移動する場合は、以下の例のセクションを参照してください。

source: To instead move the contents of a folder (all its files and subfolders), see the examples section of FileMove.
ja: フォルダの内容（すべてのファイルとサブフォルダ）を移動する場合は、FileMoveの例のセクションを参照してください。

source: To instead open the folder for all users, enter shell:common startup (however, in that case you must be an administrator to proceed).
ja: 代わりに全ユーザーのフォルダを開くには、shell:common startupと入力します（ただし、この場合は管理者でないと進めません）。

source: To instead operate upon only the topmost window, follow this example:
ja: その代わりに、一番上のウィンドウだけを操作する場合は、次のようにします：

source: To instead perform the check according to the rules of the current user's locale, specify the string "Locale" for the Mode parameter.
ja: 代わりに、現在のユーザーのロケールの規則に従ってチェックを行うには、Modeパラメータに文字列"Locale"を指定します。

source: To instead perform the check according to the rules of the current user's locale, use IsAlpha(Value, "Locale").
ja: 代わりに、現在のユーザーのロケールの規則に従ってチェックを行うには、IsAlpha(Value, "Locale")を使用します。

source: To instead perform the check according to the rules of the current user's locale, use IsLower(Value, "Locale").
ja: 代わりに、現在のユーザーのロケールの規則に従ってチェックを行うには、IsLower(Value, "Locale")を使用します。

source: To instead perform the check according to the rules of the current user's locale, use IsUpper(Value, "Locale").
ja: 代わりに、現在のユーザーのロケールの規則に従ってチェックを行うには、IsUpper(Value, "Locale")を使用します。

source: To instead retrieve the position of the selected item, follow this example (use only one of the first two lines):
ja: 選択された項目の位置を取得する代わりに、次の例に従います（最初の2行のうち1行だけを使用します）：

source: To instead search right-to-left, use InStr(a, b,, -1, -2).
ja: 右から左へ検索する場合は、InStr(a, b,, -1, -2)を使用します。

source: To instead sort all top-level items, use TV.Modify(0, "Sort").
ja: 代わりにすべてのトップレベル項目をソートするには、TV.Modify(0, "Sort")を使用します。

source: To instead wait for a different window to become active, specify its unique ID as in the following example:
ja: 代わりに別のウィンドウがアクティブになるのを待つには、次の例のように一意のIDを指定します：

source: To instead wait for the bar's text to change, either use StatusBarGetText in a loop, or use the RegEx example at the bottom of this page.
ja: バーのテキストが変わるのを待つには、ループ内でStatusBarGetTextを使うか、このページの一番下にあるRegExの例を使う。

source: To instead wait for the current active window to close, specify its title or unique ID as in the following example:
ja: 現在のアクティブ・ウィンドウが閉じるのを待つには、次の例のようにタイトルかユニークIDを指定する：

source: To jump to a label dynamically, use parentheses immediately after the name:
ja: ラベルに動的にジャンプするには、名前のすぐ後に括弧を使用します：

source: To jump to a label dynamically, use parentheses immediately after the name: goto(expression).
ja: ラベルに動的にジャンプするには、名前のすぐ後に括弧を使用します：goto(expression)。

source: To just press (hold down) or release the key, follow the key name with the word "down" or "up" as shown below.
ja: キーを押したり離したりするだけなら、以下のようにキー名の後に「down」や「up」をつけてください。

source: To keep a GUI window "alive" without calling Show or retaining a reference to its Gui object, the script can increment the object's reference count with ObjAddRef (in which case ObjRelease must be called when the window is no longer needed).
ja: Showを呼び出したり、Guiオブジェクトへの参照を保持することなくGUIウィンドウを「生かす」ために、スクリプトはObjAddRefでオブジェクトの参照カウントを増やすことができます（この場合、ウィンドウが不要になったときにObjReleaseが呼び出される必要があります）。

source: To keep the download, methods vary between browsers.
ja: ダウンロードを維持するために、ブラウザによって方法が異なります。

source: To keep the script running even if it failed to restart (i.e. because the script file has been changed or deleted), remove ExitApp and use RunWait instead of Run.
ja: 再起動に失敗した場合（スクリプトファイルが変更または削除された場合など）でもスクリプトを実行し続けるには、ExitAppを削除して、Runの代わりにRunWaitを使用します。

source: To keep the script running even if the user cancels the UAC prompt, move ExitApp into the try block.
ja: ユーザーがUACプロンプトをキャンセルしてもスクリプトを実行し続けるために、ExitAppをtryブロックに移動します。

source: To later collapse the item, use TV.Modify(ItemID, "-Expand").
ja: 後でアイテムを折りたたむには、TV.Modify(ItemID, "-Expand")を使用します。

source: To later create additional controls that obey the current theme, turn it back on via +Theme.
ja: 現在のテーマに従った制御を後から追加で作成する場合は、+Themeでオンに戻してください。

source: To later de-focus it, use LV.Modify(RowNumber, "-Focus").
ja: 後でフォーカスを外すには、LV.Modify(RowNumber, "-Focus")を使用します。

source: To later deselect it, use LV.Modify(RowNumber, "-Select").
ja: 後で選択を解除するには、LV.Modify(RowNumber, "-Select")を使用します。

source: To later load the file back onto the clipboard (or into a variable), follow this example:
ja: 後でファイルをクリップボードに（または変数に）読み戻すには、次の例に従います：

source: To later show the cursor, press this hotkey again.
ja: 後でカーソルを表示させるには、このホットキーをもう一度押してください。

source: To later un-bold the item, use TV.Modify(ItemID, "-Bold").
ja: 後でアイテムのボールドを解除するには、TV.Modify(ItemID, "-Bold")を使用します。

source: To later uncheck it, use LV.Modify(RowNumber, "-Check").
ja: 後でチェックを外すには、LV.Modify(RowNumber, "-Check")を使用します。

source: To later uncheck it, use TV.Modify(ItemID, "-Check").
ja: 後でチェックを外すには、TV.Modify(ItemID, "-Check")を使用します。

source: To launch other programs, simply replace the path in the example above with the path of the program you wish to launch.
ja: 他のプログラムを起動する場合は、上記の例のパスを起動したいプログラムのパスに置き換えるだけです。

source: To learn how to customize the hotkeys or create your own, see How to Write Hotkeys.
ja: ホットキーのカスタマイズや独自に作成する方法については、「ホットキーの書き方」を参照してください。

source: To learn how to try it out, refer to How to Run Example Code.
ja: 試す方法は、「サンプルコードを実行する方法」を参照してください。

source: To learn more, see How to Manage Windows.
ja: 詳しくは、「Windowsを管理する方法」をご覧ください。

source: To learn the basics of regular expressions (or refresh your memory of pattern syntax), see the RegEx Quick Reference.
ja: 正規表現の基本を学ぶ（またはパターン構文の記憶を取り戻す）には、RegExクイックリファレンスをご覧ください。

source: To load an entire file into a variable, use FileRead because it performs much better than a loop (especially for large files).
ja: ファイル全体を変数に読み込むには、ループよりもはるかに性能が良い（特に大きなファイルの場合）ので、FileReadを使用します。

source: To make a hotkey fire only when you release the key instead of when you press it, use the UP suffix.
ja: 押したときではなく、離したときにのみホットキーを起動させる場合は、UP 接尾辞にします。

source: To make a hotstring call a function when triggered, pass the function by reference.
ja: ホットストリングがトリガーされたときに関数を呼び出すようにするには、関数を参照で渡します。

source: To make an Edit control read-only, specify the string ReadOnly instead.
ja: Editコントロールを読み取り専用にするには、代わりに文字列ReadOnlyを指定します。

source: To make any field blank, specify "" or the equivalent.
ja: 任意のフィールドを空白にする場合は、""または同等のものを指定します。

source: To make context-sensitive hotkeys and hotstrings, simply precede them with the #HotIf directive.
ja: 文脈依存のホットキーや ホットストリングを作るには、単に#HotIfディレクティブを先行させればよい。

source: To make effective use of ComObjConnect, you must first write functions in the script to handle any events of interest.
ja: ComObjConnectを有効に活用するためには、まずスクリプトに関数を記述し、対象となるイベントを処理する必要があります。

source: To make it visible later, use LV.Opt("+Hdr").
ja: 後から見えるようにするには、LV.Opt("+Hdr")を使用します。

source: To make space an ending character, include it between two other characters in the list (or at the beginning if the list contains only one other character, or no other characters).
ja: スペースを終端文字にするには、リスト内の他の2つの文字の間（リストに他の文字が1つしかない場合、または他の文字がない場合は先頭）に含めます。

source: To make tab an ending character, include `t in the list.
ja: tabを終端文字にする場合は、`tをリストに入れます。

source: To make tab or space an ending character, include `t or `s in the list.
ja: タブまたはスペースをエンディングキャラクターにするには、それぞれ`t または `s をリストに含めてください。

source: To make tabs appear on the right side of the control, also use the TCS_RIGHT style.
ja: コントロールの右側にタブを表示するには、TCS_RIGHTスタイルも使用する。

source: To make the Start Menu's submenus transparent, also include the script from example #3.
ja: スタートメニューのサブメニューを透明にするには、例3のスクリプトも含めてください。

source: To make the background transparent, use WinSetTransColor.
ja: 背景を透明にする場合は、WinSetTransColorを使用します。

source: To mark a color as transparent, use WinSetTransColor.
ja: 色を透明としてマークするには、WinSetTransColor関数を使用します。

source: To mark a parameter as optional without supplying a default value, use the keyword unset or the ? suffix.
ja: デフォルト値を与えずにパラメータをオプションとしてマークするには、キーワードunsetまたは接尾辞?を使用します。

source: To move or rename a single folder, use DirMove.
ja: 1つのフォルダーを移動したり、名前を変更したりするには、DirMoveを使用します。

source: To move the mouse without clicking, specify 0 after the coordinates; for example:
ja: クリックせずにマウスを移動させる場合は、座標の後に0を指定します（例）：

source: To move the mouse without clicking, specify 0 after the coordinates; for example: Send "{Click 100 200 0}".
ja: クリックせずにマウスを移動させる場合は、座標の後に0を指定します（例：Send "{Click 100 200 0}"）。

source: To only press (hold down) or release a key, enclose the key name in braces, followed by a space and then the word "down" or "up".
ja: キーを押す（押し続ける）、または離すだけなら、キー名を中括弧で囲み、その後にスペースを入れ、「down」または「up」という言葉を入れます。

source: To open a CLSID folder via Run, simply specify the CLSID as the first parameter.
ja: RunでCLSIDフォルダを開くには、最初のパラメータにCLSIDを指定するだけです。

source: To open a script for editing, right-click on the script file and select Edit Script.
ja: スクリプトを開いて編集するには、スクリプト ファイルを右クリックし、［スクリプトの編集］を選択します。

source: To override this and use mode 1 unconditionally, specify the word Pos in Options as in the following example:
ja: これを上書きして無条件にモード1を使用するには、次の例のようにOptionsにPosという語を指定します。

source: To override this and use mode 1 unconditionally, specify the word Pos in Options as in the following example: ControlClick "x255 y152", WinTitle,,,, "Pos".
ja: これを上書きして無条件にモード1を使用するには、次の例のようにOptionsにPosという語を指定します：ControlClick "x255 y152", WinTitle,,,, "Pos"。

source: To override this default, use CoordMode "Menu", Mode or A_CoordModeMenu := Mode.
ja: このデフォルトを上書きするには、CoordMode"Menu",ModeまたはA_CoordModeMenu :=Modeを使用します。

source: To override this mode for a particular click, use a specific Send function in combination with {Click}, as in this example:
ja: 特定のクリックに対してこのモードを上書きするには、この例のように{Click}と組み合わせて特定のSend関数を使用します。

source: To override this mode for a particular click, use a specific Send function in combination with {Click}, as in this example: SendEvent "{Click 100 200}".
ja: 特定のクリックに対してこのモードを上書きするには、この例のように{Click}と組み合わせて特定のSend関数を使用します：SendEvent "{Click 100 200}"。

source: To overwrite an existing file, delete it with FileDelete prior to using FileAppend.
ja: 既存のファイルを上書きする場合は、FileAppendを使用する前にFileDeleteでファイルを削除してください。

source: To pass a NULL handle or pointer, pass the integer 0.
ja: NULLハンドルまたはポインタを渡す場合は、整数0を渡します。

source: To pass an array of values, use a variadic function call:
ja: 値の配列を渡すには、バリアディック関数呼び出しを使用します：

source: To pass an optional parameter through to another function even when the parameter has no value, use the maybe operator (var?).
ja: オプションのパラメータに値がない場合でも他の関数に渡すには、maybe演算子（var?）。

source: To pass parameters, add them immediately after the program or document name.
ja: パラメータを渡すには、プログラム名や文書名の直後にパラメータを追加します。

source: To pass such parameters, do not use Reload.
ja: このようなパラメータを渡すには、Reloadを使用しないでください。

source: To pause or resume the entire script at the press of a key, assign a hotkey to the Pause function as in this example:
ja: キーを押すだけでスクリプト全体を一時停止または再開するには、この例のようにホットキーを「一時停止」機能に割り当てます：

source: To perform a shift-click or control-click, clicking via Send is generally easiest.
ja: Shift-ClickやControl-Clickを行うには、一般的にSend経由のクリックが最も簡単です。

source: To perform a shift-click or control-click, use the Send function before and after the operation as shown in these examples:
ja: シフトクリックやコントロールクリックを行うには、以下の例のように操作の前後に送信機能を使用します：

source: To perform a simple copy -- retaining the existing file name(s) -- specify only the folder name as shown in these mostly equivalent examples:
ja: 既存のファイル名を残したまま単純にコピーする場合は、以下の例のようにフォルダ名のみを指定します：

source: To perform a simple move -- retaining the existing file name(s) -- specify only the folder name as shown in these mostly equivalent examples:
ja: 既存のファイル名を残したまま、単純に移動する場合は、以下の例のようにフォルダ名のみを指定します：

source: To perform actions such as resizing, hiding, or changing the font of a ListView, see GuiControl object.
ja: リストビューのサイズ変更、非表示、フォント変更などの操作を行うには、GuiControlオブジェクトを参照してください。

source: To perform actions such as resizing, hiding, or changing the font of a TreeView, see GuiControl object.
ja: TreeViewのサイズ変更、非表示、フォント変更などのアクションを実行するには、GuiControlオブジェクトを参照してください。

source: To permit a function to accept any number of parameters without creating an array to store the surplus parameters, write * as the final parameter (without a parameter name).
ja: 余ったパラメータを格納する配列を作成することなく、関数が任意の数のパラメータを受け取ることを許可するには、最後のパラメータとして*を記述します（パラメータ名を指定しない）。

source: To permit caching, precede the URL with *0 followed by a space; for example:
ja: キャッシュを許可する場合は、URLの前に*0とスペースを入れてください：

source: To permit caching, precede the URL with *0 followed by a space; for example: "*0 https://someorg.org".
ja: キャッシュを許可する場合は、URLの前に*0とスペースを入れてください："*0 https://someorg.org"。

source: To permit pre-release versions, include a hyphen suffix.
ja: プレリリース版を許可する場合は、ハイフン（-）を付けてください。

source: To precisely determine the elapsed time between two events, use the A_TickCount method because it provides millisecond precision.
ja: 2つのイベント間の経過時間を正確に求めるには、ミリ秒単位の精度を持つA_TickCountメソッドを使用します。

source: To prevent that from happening in the first place (or happening again), you can use the Timeout parameter of WinWait.
ja: このような事態を未然に防ぐ（あるいは再発を防ぐ）には、WinWaitのTimeoutパラメータを使用します。

source: To prevent the user from interacting with the owner while one of its owned window is visible, disable the owner via MyGui.Opt("+Disabled").
ja: オーナーウィンドウが表示されているときに、ユーザーがオーナーと対話できないようにするには、MyGui.Opt("+Disabled")でオーナーを無効化します。

source: To prevent this hotkey from being suspended after the suspension has been turned on and thus no longer being able to turn it off, it must be exempted.
ja: このホットキーは、サスペンドがオンになった後、サスペンドをオフにすることができなくなるのを防ぐため、例外にする必要があります。

source: To prevent this, enclose the string in single or double quote marks.
ja: これを防ぐには、文字列をシングルクォートまたはダブルクォートで囲んでください。

source: To prevent this, first assign a custom color and then make that color transparent.
ja: これを防ぐには、まずカスタムカラーを割り当て、そのカラーを透明にします。

source: To prevent this, include a trailing period (.) in the file name.
ja: これを避けるには、ファイル名の末尾にピリオド（.）を含めてください。

source: To prevent this, include a trailing point character (.) in the file name.
ja: これを防ぐには、ファイル名に末尾のポイント文字(.)を入れてください。

source: To prevent this, include the word "On" in OnOffToggle.
ja: これを防ぐには、OnOffToggleに"On"という単語を含めます。

source: To prevent this, include the word ON in Options.
ja: これを防ぐには、「オプション」に「ON」を入れてください。

source: To prevent this, store the desired tray icon inside a .ICO file.
ja: これを防ぐには、必要なトレイアイコンを.ICOファイルに保存します。

source: To prevent this, the keyboard or mouse hook may automatically send the mask key.
ja: これを防ぐために、キーボードやマウスのフックが自動的にマスクキーを送信する場合があります。

source: To prevent this, use #WinActivateForce.
ja: これを防ぐために、#WinActivateForceを使ってください。

source: To prevent this, use Critical as the callback's first line (however, this will also buffer/defer other threads such as the press of a hotkey).
ja: これを防ぐには、コールバックの最初の行にCriticalを使用します（ただし、この場合、ホットキーの押下など他のスレッドもバッファリング/ディファーされます）。

source: To prevent this, use WinWait to wait for the window to appear, then use WinWaitClose to wait for the user to close it.
ja: これを防ぐには、WinWaitでウィンドウが表示されるのを待ち、WinWaitCloseでユーザーがウィンドウを閉じるのを待ちます。

source: To prevent this, we have made it clear that any patent must be licensed for everyone's free use or not licensed at all.
ja: このような事態を防ぐため、私たちは、いかなる特許も、誰もが自由に使用できるようにライセンスされなければならないか、まったくライセンスされないかを明確にしました。

source: To produce standard system sounds, specify an asterisk followed by a number as shown below (note that the Wait parameter has no effect in this mode):
ja: 標準的なシステムサウンドを出すには、以下のようにアスタリスクの後に数字を指定する（このモードではWaitパラメータは効果がないことに注意）：

source: To produce the standard system sounds instead of beeping the PC Speaker, see the asterisk mode of SoundPlay.
ja: パソコンスピーカーをビープ音で鳴らす代わりに標準のシステム音を出すには、SoundPlayのアスタリスクモードをご覧ください。

source: To protect your rights, we need to make restrictions that forbid anyone to deny you these rights or to ask you to surrender the rights.
ja: あなたの権利を守るために、私たちは、誰かがあなたのこれらの権利を否定したり、あなたに権利の放棄を求めたりすることを禁じる制限を設ける必要があります。

source: To put more than one of them into effect, add them up.
ja: 複数を有効にするには。、それらを足し算します。

source: To raise a script's priority, use ProcessSetPriority "High".
ja: スクリプトの優先度を上げるには、ProcessSetPriority "High"を使用します。

source: To raise numbers other than e to a power, use the ** operator.
ja: e以外の数字を1乗にする場合は、** 演算子を使用します。

source: To re-register the current installation:
ja: 現在のインストールを再登録する：

source: To re-register v2, re-run any v2 installer or run UX\install.ahk using AutoHotkey32.exe or AutoHotkey64.exe.
ja: v2を再登録するには、任意のv2インストーラを再実行するか、AutoHotkey32.exeまたはAutoHotkey64.exeを使用してUXinstall.ahkを実行します。

source: To read and write entries from the 64-bit sections of the registry in a 32-bit script or vice versa, use SetRegView.
ja: 32ビットスクリプトでレジストリの64ビットセクションのエントリを読み書きしたり、その逆を行うには、SetRegViewを使用します。

source: To read it as a negative number with means such as RegRead, convert it to a signed 32-bit integer by using OutputVar := OutputVar << 32 >> 32 or similar.
ja: RegReadなどで負の数として読み込む場合は、OutputVar := OutputVar << 32 >> 32などで符号付き32ビット整数に変換してください。

source: To read other UTF-8 files which lack a byte order mark, use FileEncoding "UTF-8-RAW", the *P65001 option with FileRead, or "UTF-8-RAW" for the third parameter of FileOpen.
ja: バイトオーダーマークを持たない他のUTF-8ファイルを読むには、FileEncoding"UTF-8-RAW"、FileReadの*P65001オプション、FileOpenの第3パラメータに"UTF-8-RAW"を使用します。

source: To receive an ANSI string as an output parameter, follow this example:
ja: 出力パラメータとしてANSI文字列を受け取るには、次の例に従います：

source: To receive the output value, pass a VarRef such as &myVar or an object with a Ptr property.
ja: 出力値を受け取るには、&myVarなどの VarRefや Ptrプロパティを持つオブジェクトを渡します。

source: To recycle an entire directory, provide its name without a trailing backslash.
ja: ディレクトリ全体をリサイクルする場合は、末尾のバックスラッシュを除いた名前を指定します。

source: To refer to the active window, use the letter "A" in place of a window title.
ja: アクティブなウィンドウを参照するには、ウィンドウのタイトルの代わりに文字「A」を使用します。

source: To register a function to be called before any previously registered functions, specify a negative value for MaxThreads.
ja: 先に登録された関数よりも先に呼び出されるように関数を登録する場合は、MaxThreadsに負の値を指定します。

source: To remap some other key to become a "mystery key", follow this example:
ja: 他のキーを "何れかのキー "に再マッピングする場合は、この例に従います。

source: To remap the mouse instead of the keyboard, use the same approach.
ja: キーボードの代わりにマウスをリマップするには、同じ方法を使います。

source: To remove a window's current menu bar, use MyGui.MenuBar := "" (that is, assign an empty string).
ja: ウィンドウの現在のメニューバーを削除するには、MyGui.MenuBar := ""（つまり、空の文字列を代入）を使用します。

source: To remove an entire folder, along with all its sub-folders and files, use DirDelete.
ja: フォルダ全体を、そのサブフォルダやファイルとともに削除するには、DirDeleteを使用します。

source: To remove an option, precede it with a minus sign.
ja: オプションを削除する場合は、オプションの前にマイナス記号を付けます。

source: To remove properties and items
ja: プロパティとアイテムを削除するには

source: To remove properties and items:
ja: プロパティとアイテムを削除するには

source: To remove such quotes, use A_Args[1] := StrReplace(A_Args[1], '"')
ja: このような引用符を削除するには、A_Args[1] := StrReplace(A_Args[1], '"')を使用する。

source: To remove the leading zeros, follow this example:
ja: 先頭のゼロを取り除くには、次の例に従ってください：

source: To remove the leading zeros, follow this example: Milliseconds := A_MSec + 0.
ja: 先頭のゼロを取り除くには、次の例に従ってください：Milliseconds := A_MSec + 0。

source: To replace (overwrite) the list instead, use GuiCtrl.Delete beforehand.
ja: 代わりにリストを置き換える（上書きする）には、あらかじめGuiCtrl.Deleteを使用してください。

source: To replace simple substrings, use StrReplace because it is faster than RegExReplace.
ja: 単純な部分文字列の置換には、RegExReplaceよりも高速なStrReplaceを使用します。

source: To represent something real or conceptual.
ja: 現実的なもの、概念的なものを表現すること。

source: To require the match to occur only at the beginning or end, use an anchor.
ja: 最初か最後だけにマッチさせるは、アンカーを使います。

source: To resolve this situation, remove the circular reference.
ja: この状況を解決するには、循環参照を削除する。
